Revit 2027 API
AssetPropertyDoubleArray3d.SetValueAsXYZ Method
 Sets the value property as a vector or point XYZ.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetValueAsXYZ(
	XYZ xyz
)
Public Sub SetValueAsXYZ (
	xyz As XYZ
)
public:
void SetValueAsXYZ(
	XYZ^ xyz
)
member SetValueAsXYZ :
        xyz : XYZ -> unit
Parameters
xyz XYZ
 The new value.
Exceptions
Exception | Condition
ArgumentException |  The input value is invalid for this AssetPropertyDoubleArray3d property.
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  The asset property is not editable.
See Also
Reference
AssetPropertyDoubleArray3d Class
Autodesk.Revit.DB.Visual Namespace